Revit 2027 API
FailuresAccessor.PostFailure Method
 Posts an additional failure message to be processed for the current transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PostFailure(
	FailureMessage failure
)
Public Sub PostFailure (
	failure As FailureMessage
)
public:
void PostFailure(
	FailureMessage^ failure
)
member PostFailure :
        failure : FailureMessage -> unit
Parameters
failure FailureMessage
 Failure message to post.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 Should be used during failures processing instead of a similar method in a document class. Using method of the document class with the same name during failures processing is prohibited.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace